results/1/aj-Lenovo-G500s/apiary-1.4.3/HELLO.log
Benchmarking HELLO
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.88ms   45.60ms   1.33s    99.06%
    Req/Sec    19.64k     1.31k   22.86k    83.67%
  1172469 requests in 30.02s, 174.43MB read
Requests/sec:  39060.22
Transfer/sec:      5.81MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.39ms   77.52ms   1.69s    98.61%
    Req/Sec    19.20k     2.42k   26.71k    84.00%
  1146687 requests in 30.01s, 170.60MB read
  Socket errors: connect 0, read 30, write 0, timeout 25
Requests/sec:  38207.13
Transfer/sec:      5.68MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.17ms   71.33ms   1.55s    98.65%
    Req/Sec    19.80k     1.50k   28.36k    92.17%
  1181828 requests in 30.01s, 175.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 50
Requests/sec:  39381.63
Transfer/sec:      5.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.31ms   74.60ms   1.67s    98.71%
    Req/Sec    19.67k     1.89k   27.61k    88.17%
  1174711 requests in 30.02s, 174.77MB read
  Socket errors: connect 0, read 22, write 0, timeout 26
Requests/sec:  39127.57
Transfer/sec:      5.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.46ms   72.32ms   1.52s    98.61%
    Req/Sec    19.76k     1.55k   26.58k    88.00%
  1179912 requests in 30.02s, 175.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 87
Requests/sec:  39307.93
Transfer/sec:      5.85MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.97ms   82.35ms   1.99s    98.49%
    Req/Sec    19.47k     4.08k   42.17k    92.00%
  1162702 requests in 30.02s, 172.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 16
Requests/sec:  38735.36
Transfer/sec:      5.76MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.23ms   72.82ms   1.78s    98.86%
    Req/Sec    19.55k     1.34k   23.35k    87.33%
  1167238 requests in 30.01s, 173.65MB read
  Socket errors: connect 0, read 0, write 0, timeout 88
Requests/sec:  38897.21
Transfer/sec:      5.79MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.95ms   77.62ms   1.76s    98.71%
    Req/Sec    19.68k     3.49k   39.54k    86.56%
  1151599 requests in 30.02s, 171.33MB read
  Socket errors: connect 0, read 27, write 0, timeout 38
Requests/sec:  38359.88
Transfer/sec:      5.71MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.74ms   67.61ms   1.63s    98.77%
    Req/Sec    19.37k     1.77k   26.80k    77.83%
  1156742 requests in 30.02s, 172.09MB read
Requests/sec:  38536.99
Transfer/sec:      5.73MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.26ms   73.61ms   1.71s    98.82%
    Req/Sec    19.70k     1.80k   24.79k    82.33%
  1175943 requests in 30.01s, 174.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 99
Requests/sec:  39185.72
Transfer/sec:      5.83MB
=================== summary ===================
machine:      aj-Lenovo-G500s
ghc version:  7.8.4
bench target: apiary-1.4.3
bench:        HELLO
bench mode:   30s * 10
average:      38879.96
stdev:        406.08
=================== oneline ===================
aj-Lenovo-G500s,7.8.4,apiary-1.4.3,HELLO,30s,10,38879.96,406.08